In [0]:
import pandas as pd
import numpy as np

In [0]:
%tensorflow_version 2.x
import tensorflow as tf

In [7]:
tf.__version__

'2.1.0-rc1'

In [8]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [0]:
df= pd.read_csv("/content/drive/My Drive/Great Learning/bank.csv", delimiter=",")

In [10]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [11]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [12]:
df.shape

(10000, 14)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
RowNumber          10000 non-null int64
CustomerId         10000 non-null int64
Surname            10000 non-null object
CreditScore        10000 non-null int64
Geography          10000 non-null object
Gender             10000 non-null object
Age                10000 non-null int64
Tenure             10000 non-null int64
Balance            10000 non-null float64
NumOfProducts      10000 non-null int64
HasCrCard          10000 non-null int64
IsActiveMember     10000 non-null int64
EstimatedSalary    10000 non-null float64
Exited             10000 non-null int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [0]:
df= df.drop('RowNumber',axis=1)

In [0]:
df= df.drop('CustomerId',axis=1)

In [0]:
df= df.drop('Surname',axis=1)

In [17]:
df.head()

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France  Female  ...               1        101348.88       1
1          608     Spain  Female  ...               1        112542.58       0
2          502    France  Female  ...               0        113931.57       1
3          699    France  Female  ...               0         93826.63       0
4          850     Spain  Female  ...               1         79084.10       0

[5 rows x 11 columns]

In [18]:
df.shape

(10000, 11)

In [0]:
x=df.iloc[:,:10]
y=df.iloc[:,10]

In [20]:
x.head()

   CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France  Female  ...          1               1        101348.88
1          608     Spain  Female  ...          0               1        112542.58
2          502    France  Female  ...          1               0        113931.57
3          699    France  Female  ...          0               0         93826.63
4          850     Spain  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [21]:
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [22]:
x.dtypes

CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
dtype: object

In [23]:
#deal with categorical data --> encode them

from sklearn.preprocessing import LabelEncoder
labelencoder_x = LabelEncoder()
x.iloc[:, 1] = labelencoder_x.fit_transform(x.iloc[:, 1]) #applying on Geography
x.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0  Female  ...          1               1        101348.88
1          608          2  Female  ...          0               1        112542.58
2          502          0  Female  ...          1               0        113931.57
3          699          0  Female  ...          0               0         93826.63
4          850          2  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [24]:
#apply encoder on Gender as well
labelencoder_x_2 = LabelEncoder()
x.iloc[:, 2] = labelencoder_x_2.fit_transform(x.iloc[:, 2]) #applying on Gender
x.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0       0  ...          1               1        101348.88
1          608          2       0  ...          0               1        112542.58
2          502          0       0  ...          1               0        113931.57
3          699          0       0  ...          0               0         93826.63
4          850          2       0  ...          1               1         79084.10

[5 rows x 10 columns]

In [25]:
#One hot encoding. 

from keras.utils import to_categorical
encoded = pd.DataFrame(to_categorical(x.iloc[:, 1]))
#no need to encode Gender, as there are only two categories

x = pd.concat([encoded, x], axis = 1)
x.head()

Using TensorFlow backend.

     0    1    2  ...  HasCrCard  IsActiveMember  EstimatedSalary
0  1.0  0.0  0.0  ...          1               1        101348.88
1  0.0  0.0  1.0  ...          0               1        112542.58
2  1.0  0.0  0.0  ...          1               0        113931.57
3  1.0  0.0  0.0  ...          0               0         93826.63
4  0.0  0.0  1.0  ...          1               1         79084.10

[5 rows x 13 columns]

In [26]:
#Dropping the existing "geography" category, and one of the onehotcoded columns.

x = x.drop(['Geography', 0], axis = 1)
x.head()

     1    2  CreditScore  ...  HasCrCard  IsActiveMember  EstimatedSalary
0  0.0  0.0          619  ...          1               1        101348.88
1  0.0  1.0          608  ...          0               1        112542.58
2  0.0  0.0          502  ...          1               0        113931.57
3  0.0  0.0          699  ...          0               0         93826.63
4  0.0  1.0          850  ...          1               1         79084.10

[5 rows x 11 columns]

In [0]:
#train and test set split, and feature scaling

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size = 0.2, random_state = 0)
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [0]:
Y_train = tf.keras.utils.to_categorical(Y_train, num_classes=2)
Y_test = tf.keras.utils.to_categorical(Y_test, num_classes=2)

In [0]:
# Initialize Sequential model
tf.keras.backend.clear_session()
model = tf.keras.models.Sequential()
model.add(tf.keras.layers.Dense(4, input_dim=11, kernel_initializer='normal', activation='relu'))
model.add(tf.keras.layers.Dense(2, activation='softmax'))

In [0]:
# Create optimizer with non-default learning rate
sgd_optimizer = tf.keras.optimizers.SGD(lr=0.03)

# Compile the model
model.compile(optimizer = 'adam', loss = "binary_crossentropy", metrics = ['accuracy'])

Optimized below model with using:
1. Different number of layers
2. Different number of neurons in all layers
3. Different activations funcitons- sigmoid, relu

In [0]:
tf.keras.backend.clear_session()
#there is no rule on how many nodes each hidden layer should have
model = tf.keras.models.Sequential()
model.add(tf.keras.layers.Dense(6, input_dim=11, kernel_initializer='normal', activation='relu'))
model.add(tf.keras.layers.Dense(4, input_dim=6, kernel_initializer='normal', activation='relu'))
#init --> initialize weights according to uniform distribution
#input_dim is required for the first hidden layer, as it is the first starting point. --> number of nodes.
#output_dim --> number of nodes of the hidden layer
#model.add(tf.keras.layers.Dense(4, input_dim=6, kernel_initializer='normal', activation='relu'))
#input_dim --> remove it as it already knows what to expect.

#the output layer
model.add(tf.keras.layers.Dense(2, activation='softmax'))
#output_dim should be 1, as output is binary outcome, and activation should be 'sigmoid'
#If dependent variables have more than two categories, use activation = 'softmax'

#compile the model --> backpropagation -> gradient descent
model.compile(optimizer = 'adam', loss = "categorical_crossentropy", metrics = ['accuracy'])

In [69]:
Y_test.shape

(2000, 2)

In [71]:
model.fit(X_train, Y_train, validation_data=(X_test, Y_test), epochs=10)

Train on 8000 samples, validate on 2000 samples
Epoch 1/10
8000/8000 [==============================] - 1s 100us/sample - loss: 0.5559 - accuracy: 0.7925 - val_loss: 0.4589 - val_accuracy: 0.7975
Epoch 2/10
8000/8000 [==============================] - 0s 51us/sample - loss: 0.4327 - accuracy: 0.8054 - val_loss: 0.4145 - val_accuracy: 0.8270
Epoch 3/10
8000/8000 [==============================] - 0s 53us/sample - loss: 0.4085 - accuracy: 0.8221 - val_loss: 0.3995 - val_accuracy: 0.8330
Epoch 4/10
8000/8000 [==============================] - 0s 52us/sample - loss: 0.3953 - accuracy: 0.8295 - val_loss: 0.3884 - val_accuracy: 0.8400
Epoch 5/10
8000/8000 [==============================] - 0s 52us/sample - loss: 0.3819 - accuracy: 0.8401 - val_loss: 0.3749 - val_accuracy: 0.8460
Epoch 6/10
8000/8000 [==============================] - 0s 56us/sample - loss: 0.3701 - accuracy: 0.8500 - val_loss: 0.3630 - val_accuracy: 0.8485
Epoch 7/10
8000/8000 [==============================] - 0s 53us/sample - loss: 0.3614 - accuracy: 0.8526 - val_loss: 0.3566 - val_accuracy: 0.8560
Epoch 8/10
8000/8000 [==============================] - 0s 52us/sample - loss: 0.3557 - accuracy: 0.8553 - val_loss: 0.3481 - val_accuracy: 0.8605
Epoch 9/10
8000/8000 [==============================] - 0s 52us/sample - loss: 0.3519 - accuracy: 0.8565 - val_loss: 0.3441 - val_accuracy: 0.8590
Epoch 10/10
8000/8000 [==============================] - 0s 52us/sample - loss: 0.3490 - accuracy: 0.8599 - val_loss: 0.3441 - val_accuracy: 0.8565

In [84]:
model.summary()

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 6)                 72
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 28
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 10
=================================================================
Total params: 110
Trainable params: 110
Non-trainable params: 0
_________________________________________________________________

In [99]:
Y_test.dtype

dtype('float32')

In [100]:
y_pred.dtype

dtype('float32')

In [0]:
y_pred = model.predict(X_test)

In [0]:
y_pred = (y_pred > 0.5) #to classify each probability into True or False
y_pred=y_pred.astype('float32')

In [103]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(
    Y_test.argmax(axis=1), y_pred.argmax(axis=1))
print (cm, '\n\n', y_pred[:5, :])

[[1501   94]
 [ 193  212]]

 [[1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]]

FInding Accuracy

In [105]:
(1501+212)/2000

0.8565